backend/app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    articles = Article.all()

INSERT INTO "articles" ("title", "body", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Article new 1"], ["body", "this is a new article 1!"], ["author", "Author 1"], ["created_at", "2023-06-20 09:14:19.850858"], ["updated_at", "2023-06-20 09:14:19.850858"]]
---
  def create
    article = Article.new(article_params)

    if article.save

UPDATE "articles" SET "title" = ?, "body" = ?, "author" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Article new 3"], ["body", "this is a new article 3!"], ["author", "Author 3"], ["updated_at", "2023-06-20 09:16:08.414406"], ["id", 5]]
---
  def update
    if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]
---
  def destroy
    if @article
      @article.destroy